cask_args appdir: "/Applications"

tap "augmentable-dev/askgit"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "hashicorp/tap"

brew "asciinema"
brew "askgit"
brew "autoconf"
brew "automake"
brew "aws-sam-cli"
brew "bash"
brew "bat"
brew "coreutils"
brew "croc"
brew "curl"
brew "duf"
brew "findutils"
brew "glow"
brew "hadolint"
brew "fd"
brew "gettext"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "git-secrets"
brew "gnupg"
brew "golangci-lint"
brew "grep"
brew "hashicorp/tap/terraform"
brew "hey"
brew "httpstat"
brew "httpie"
brew "jq"
brew "libtool"
brew "mkcert"
brew "moreutils"
brew "n"
brew "nano",
brew "nss" # required for mkcert
brew "openssh"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "postgis"
brew "python"
brew "rbenv"
brew "redis", restart_service: true
brew "ruby-build"
brew "tmate"
brew "tmux"
brew "tree"
brew "v8@3.15"
brew "yarn"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "wget"

cask "docker"
cask "emacs"
cask "mounty"
